Autodesk.Revit.DB.Analysis.gbXMLBuildingType
Enumerations for gbXML (Green Building XML) format, used for energy
analysis, schema version 0.34.
This enumeration corresponds to the buildingType attribute in gbXML and
is used to specify the most predominant building use type.
Since:
2011